podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SDHC0_MK65F18.svd.xml
<!--
Devices using this peripheral: 
      MK65F18
      MK66F18
-->
      <peripheral>
         <?sourceFile "SDHC0_MK65F18" ?>
         <name>SDHC0</name>
         <description>Secured Digital Host Controller</description>
         <groupName>SDHC</groupName>
         <prependToName>SDHC0</prependToName>
         <headerStructName>SDHC0</headerStructName>
         <baseAddress>0x400B1000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x48</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x50</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x54</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xC0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xFC</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DSADDR</name>
               <description>DMA System Address Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>DSADDR</name>
                     <description>DMA System Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BLKATTR</name>
               <description>Block Attributes Register</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>BLKSIZE</name>
                     <description>Transfer Block Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No data transfer</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>1 Byte</description>
                           <value>0b1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>2 Bytes</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>3 Bytes</description>
                           <value>0b11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>4 Bytes</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111111111</name>
                           <description>511 Bytes</description>
                           <value>0b111111111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000000000</name>
                           <description>512 Bytes</description>
                           <value>0b1000000000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100000000000</name>
                           <description>2048 Bytes</description>
                           <value>0b100000000000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000000000000</name>
                           <description>4096 Bytes</description>
                           <value>0b1000000000000</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BLKCNT</name>
                     <description>Blocks Count For Current Transfer</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Stop count</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>1 block</description>
                           <value>0b1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>2 blocks</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1111111111111111</name>
                           <description>65535 blocks</description>
                           <value>0b1111111111111111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMDARG</name>
               <description>Command Argument Register</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>CMDARG</name>
                     <description>Command Argument</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>XFERTYP</name>
               <description>Transfer Type Register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>DMAEN</name>
                     <description>DMA Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="DMAEN" > <name>BCEN</name> <description>Block Count Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="DMAEN" > <name>AC12EN</name> <description>Auto CMD12 Enable</description> <bitOffset>2</bitOffset> </field>
                  <field>
                     <name>DTDSEL</name>
                     <description>Data Transfer Direction Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Write (host to card)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Read (card to host)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MSBSEL</name>
                     <description>Multi/Single Block Select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Single block</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Multiple blocks</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSPTYP</name>
                     <description>Response Type Select</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>No response</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Response length 136</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Response length 48</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Response length 48, check busy after response</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="DMAEN" > <name>CCCEN</name> <description>Command CRC Check Enable</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="DMAEN" > <name>CICEN</name> <description>Command Index Check Enable</description> <bitOffset>20</bitOffset> </field>
                  <field>
                     <name>DPSEL</name>
                     <description>Data Present Select</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No data present</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Data present</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDTYP</name>
                     <description>Command Type</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Normal other commands</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Suspend CMD52 for writing bus suspend in CCCR</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Resume CMD52 for writing function select in CCCR</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Abort CMD12, CMD52 for writing I/O abort in CCCR</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDINX</name>
                     <description>Command Index</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>CMDRSP%s</name>
               <description>Command Response %s</description>
               <addressOffset>0x10</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CMDRSP0</name>
                     <description>Command Response 0</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>DATPORT</name>
               <description>Buffer Data Port Register</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>DATCONT</name>
                     <description>Data Content</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
